BaseConfiguration/Money_2_0/InformationRegisters/ПоказателиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПоказателиБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВариантБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Comment>Каелндарное начало периода, рассматриваемого в бюджете.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБюджетныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафаБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтатьяБюджета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ФинансовыеЦели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ФинансовыеЦели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеФинансовойЦели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНакопления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ПоказателиБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
	
#Область ПрограммныйИнтерфейс

// Выполняет проверку корректности записей, исправляет ошибки
Процедура ПроверитьЗаписи(БылиОшибки = Ложь) Экспорт
	
	ОчиститьЗаписиСНесущесвтующимиСсылками(БылиОшибки);
	
	ПроверитьСтатьиИРазделы(БылиОшибки);
	
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСлужебный.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "ПоказателиБюджета", Загрузка);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьЗаписиСНесущесвтующимиСсылками(БылиОшибки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.ВариантБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.ВариантБюджета.Ссылка ЕСТЬ NULL
	|;
	|
	|//// 1 /////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.РазделБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.РазделБюджета <> Значение(Справочник.ФинансовыеЦели.ПустаяСсылка) И Показатели.РазделБюджета.Ссылка ЕСТЬ NULL
	|;
	|
	|//// 2 /////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.ГрафаБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.ГрафаБюджета <> Значение(Справочник.ГрафыБюджета.ПустаяСсылка) И Показатели.ГрафаБюджета.Ссылка ЕСТЬ NULL
	|;
	|
	|//// 3 /////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.СтатьяБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.СтатьяБюджета <> Значение(Справочник.ФинансовыеЦели.ПустаяСсылка) 
	|	И Показатели.СтатьяБюджета <> Неопределено 
	|	И Показатели.СтатьяБюджета.Ссылка ЕСТЬ NULL
	|";
	
	РезульатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Очитска вариантов бюджета
	Выборка = РезульатыЗапроса[0].Выбрать();
	ОчиститьНаборыПоВыборке(Выборка, "ВариантБюджета", БылиОшибки, Неопределено);
	
	// Очитска разделов бюджета
	Выборка = РезульатыЗапроса[1].Выбрать();
	ДопустимыеЗначения = Новый Массив();
	ДопустимыеЗначения.Добавить(Справочники.ФинансовыеЦели.ПустаяСсылка());
	ДопустимыеЗначения.Добавить(Справочники.ФинансовыеЦели.ОбщиеНакопления);
	ОчиститьНаборыПоВыборке(Выборка, "РазделБюджета", БылиОшибки, ДопустимыеЗначения);
	
	// Очитска граф бюджета
	Выборка = РезульатыЗапроса[2].Выбрать();
	ОчиститьНаборыПоВыборке(Выборка, "ГрафаБюджета", БылиОшибки, Неопределено);
	
	// Очитска статей бюджета
	Выборка = РезульатыЗапроса[3].Выбрать();
	ДопустимыеЗначения.Добавить(Неопределено);
	ДопустимыеЗначения.Добавить(Справочники.ГрафыБюджета.ПустаяСсылка());
	ОчиститьНаборыПоВыборке(Выборка, "СтатьяБюджета", БылиОшибки, ДопустимыеЗначения);
	
КонецПроцедуры

Процедура ОчиститьНаборыПоВыборке(Выборка, ИмяИзмерения, БылиОшибки, ДоступныеЗначения = Неопределено)
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) 
			Или ДоступныеЗначения <> Неопределено И ДоступныеЗначения.Найти(Выборка.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура(ИмяИзмерения, Выборка.Ссылка));
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Бюджетирование", УровеньЖурналаРегистрации.Ошибка, , Выборка.Ссылка,
				СтрШаблон("Не удалось очистить набор показателей бюджета по измерению ""%1"" со значением ""%2"" (%3):
				|%4", ИмяИзмерения, Выборка.Ссылка, ТипЗнч(Выборка.Ссылка), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСтатьиИРазделы(БылиОшибки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ПоказателиБюджета.ВариантБюджета КАК ВариантБюджета,
		|	ПоказателиБюджета.НачалоПериода КАК НачалоПериода,
		|	ПоказателиБюджета.РазделБюджета КАК РазделБюджета,
		|	ПоказателиБюджета.ГрафаБюджета КАК ГрафаБюджета,
		|	ПоказателиБюджета.СтатьяБюджета КАК СтатьяБюджета,
		|	ПоказателиБюджета.ТипПоказателя КАК ТипПоказателя,
		|	ПоказателиБюджета.ГрафаБюджета.ТипПоказателя КАК ТипПоказателяИзГрафы,
		|	ПоказателиБюджета.Сумма КАК Сумма,
		|	ПоказателиБюджета.Порядок КАК Порядок,
		|	ПоказателиБюджета.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ПоказателиБюджета КАК ПоказателиБюджета
		|ГДЕ
		|	ПоказателиБюджета.ТипПоказателя.Ссылка ЕСТЬ NULL
		|	ИЛИ ПоказателиБюджета.СтатьяБюджета = Неопределено
		|	ИЛИ (ПоказателиБюджета.РазделБюджета = ЗНАЧЕНИЕ(Справочник.ФинансовыеЦели.ПустаяСсылка) 
		|		И ПоказателиБюджета.СтатьяБюджета.Ссылка ЕСТЬ NULL) ";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	КэшСсылок = Новый Соответствие();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Запись = РегистрыСведений.ПоказателиБюджета.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Попытка
				Запись.Удалить();
			Исключение
				БылиОшибки = Истина;
				Ошибка = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации("Бюджет", УровеньЖурналаРегистрации.Ошибка, , ,
					СтрШаблон("Не удалось удалить запись показателей бюджета:
					|%1
					|по причине:
					|%2", ЗаписьРегистраВJSON(ВыборкаДетальныеЗаписи), ПодробноеПредставлениеОшибки(Ошибка)));
			КонецПопытки;
		КонецЕсли;
		
		Если Не ОбщегоНазначенияДеньги.СсылочныйОбъектСуществует(ВыборкаДетальныеЗаписи.ВариантБюджета, КэшСсылок)
			Или Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НачалоПериода) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Если Не ЗначениеЗаполнено(Запись.СтатьяБюджета) Тогда
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РазделБюджета) И
				(ВыборкаДетальныеЗаписи.ГрафаБюджета = Справочники.ГрафыБюджета.СвободныеДеньгиВозвратИзНакопления
					Или ВыборкаДетальныеЗаписи.ГрафаБюджета = Справочники.ГрафыБюджета.СвободныеДеньгиПереводВНакопление) Тогда
				
				Запись.СтатьяБюджета = ВыборкаДетальныеЗаписи.ГрафаБюджета;
				
			ИначеЕсли Запись.СтатьяБюджета = Неопределено Тогда
				Запись.СтатьяБюджета = Справочники.ФинансовыеЦели.ПустаяСсылка();

			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ТипПоказателя) Тогда
			Запись.ТипПоказателя = ВыборкаДетальныеЗаписи.ТипПоказателяИзГрафы;
		КонецЕсли;
		
		Попытка
			Запись.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Бюджет", УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон("Не удалось записать запись показателей бюджета:
				|%1
				|по причине:
				|%2", ЗаписьРегистраВJSON(ВыборкаДетальныеЗаписи), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписьРегистраВJSON(ДанныеЗаписи)
	
	СтруктураЗаписи = Новый Структура("ВариантБюджета,НачалоПериода,РазделБюджета,ТипПоказателя,ГрафаБюджета,СтатьяБюджета");
	ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ДанныеЗаписи);
	Для Каждого КлючИЗначение Из СтруктураЗаписи Цикл
		Если ТипЗнч(КлючИЗначение.Значение) <> Тип("Дата") Тогда
			СтруктураЗаписи[КлючИЗначение.Ключ] = "" + КлючИЗначение.Значение + " (" + ТипЗнч(КлючИЗначение.Значение) + ")";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПарсерJSON.ДанныеВСтрокуJSON(СтруктураЗаписи);
	
КонецФункции

#КонецОбласти
	




#КонецЕсли
